In [31]:
import numpy as np
import pandas as pd

import seaborn as sns
titanic_df = sns.load_dataset('titanic')

In [32]:
titanic_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [33]:
titanic_df.shape

(891, 15)

In [34]:
titanic_df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [35]:
titanic_df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [38]:
titanic_df.age.mean()

np.float64(29.69911764705882)

In [45]:
titanic_df[['survived','alive']].head(10)

   survived alive
0         0    no
1         1   yes
2         1   yes
3         1   yes
4         0    no
5         0    no
6         0    no
7         0    no
8         1   yes
9         1   yes

In [40]:
titanic_df['new_col_age']=np.where(titanic_df['age'].isnull(),1,0)
titanic_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_col_age
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,0

In [41]:
titanic_df['new_col_age'].mean()

np.float64(0.19865319865319866)

In [42]:
titanic_df['new_col_age'].value_counts()

new_col_age
0    714
1    177
Name: count, dtype: int64

In [43]:
titanic_df.groupby(['survived'])['new_col_age'].value_counts()

survived  new_col_age
0         0              424
          1              125
1         0              290
          1               52
Name: count, dtype: int64

In [19]:
titanic_df.groupby(['survived'])['new_col_age'].mean()

survived
0    0.227687
1    0.152047
Name: new_col_age, dtype: float64

In [28]:
titanic_df.groupby(['survived'])['new_col_age'].value_counts()

survived  new_col_age
0         0              424
          1              125
1         0              290
          1               52
Name: count, dtype: int64

In [23]:
vidisha=pd.DataFrame(titanic_df.groupby(['survived'])['new_col_age'].mean())
vidisha

          new_col_age
survived
0            0.227687
1            0.152047

In [24]:
titanic_df['new_col_age'].value_counts()

new_col_age
0    714
1    177
Name: count, dtype: int64

In [25]:
titanic_df['survived'].value_counts()

survived
0    549
1    342
Name: count, dtype: int64

In [ ]:
titanic_df['boolean_sex']=np.where(titanic_df['sex']=='male',1,0)

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: boolean_sex, Length: 891, dtype: int64

In [49]:
titanic_df.groupby(['boolean_sex'])['new_col_age'].value_counts()

boolean_sex  new_col_age
0            0              261
             1               53
1            0              453
             1              124
Name: count, dtype: int64

In [ ]:
titanic_df.groupby(['boolean_sex'])['new_col_age'].mean()

boolean_sex
0    0.168790
1    0.214905
Name: new_col_age, dtype: float64

In [52]:
titanic_df.groupby(['survived'])['new_col_age'].value_counts()

survived  new_col_age
0         0              424
          1              125
1         0              290
          1               52
Name: count, dtype: int64

In [53]:
titanic_df.groupby(['survived'])['new_col_age'].mean()

survived
0    0.227687
1    0.152047
Name: new_col_age, dtype: float64

In [54]:
titanic_df.groupby(['survived'])['new_col_age'].value_counts().reset_index(name='count')

   survived  new_col_age  count
0         0            0    424
1         0            1    125
2         1            0    290
3         1            1     52

In [55]:
titanic_df.groupby(['survived'])['new_col_age'].value_counts().unstack()

new_col_age    0    1
survived
0            424  125
1            290   52